Repository: Mishin870/HuTaoHelper
Catalog: HuTaoHelper.Core/Localization/Translations.*.resx
Languages: ru_ru, uk_ua

# LocMenuRefreshAllAccounts
source: Refresh all accounts info
ru_ru: Обновить все аккаунты
uk_ua: Оновити всі акаунти

# LocLanguageChanged
source: Language changed to English
ru_ru: Язык изменён на Русский
uk_ua: Мову змінено на Українську

# LocMenuTools
source: Tools
ru_ru: Инструменты
uk_ua: Інструменти

# LocMenuAddAccount
source: Add an account
ru_ru: Добавить аккаунт
uk_ua: Додати акаунт

# LocMenuLanguage
source: Language
ru_ru: Язык
uk_ua: Мова

# LocMenuChangeTitle
source: Change title
ru_ru: Изменить имя
uk_ua: Змінити ім'я

# LocMenuReauthenticate
source: Reauthenticate
ru_ru: Повторить аутентификацию
uk_ua: Повторити аутентифікацію

# LocMenuRefresh
source: Refresh information
ru_ru: Обновить информацию
uk_ua: Оновити інформацію

# LocMenuRemove
source: Remove
ru_ru: Удалить
uk_ua: Видалити

# LocWebLoginButton
source: this button
ru_ru: эту кнопку
uk_ua: цю кнопку

# LocWebLoginLabel
source: Please, authenticate and click
ru_ru: Пожалуйста, аутентифицируйтесь и нажмите
uk_ua: Будь ласка, аутентифікуйтеся та натисніть

# LocWebLoginAuthentication
source: Authentication
ru_ru: Аутентификация
uk_ua: Аутентифікація

# LocChangeTitleHeader
source: Change title:
ru_ru: Изменить имя:
uk_ua: Змінити ім'я:

# LocChangeTitleHint
source: Custom title (optional)
ru_ru: Изменённое имя (опционально)
uk_ua: Змінене ім'я (необов'язково)

# LocDialogCancel
source: CANCEL
ru_ru: ОТМЕНА
uk_ua: СКАСУВАТИ

# LocDialogAccept
source: ACCEPT
ru_ru: ПРИНЯТЬ
uk_ua: ПРИЙНЯТИ

# LocAddAccountHeader
source: New account:
ru_ru: Новый аккаунт:
uk_ua: Новий акаунт:

# LocAddAccountLoginHint
source: Login / email
ru_ru: Логин / почта
uk_ua: Логін / пошта

# LogAddAccountPassword
source: Password
ru_ru: Пароль
uk_ua: Пароль

# LocRequiredField
source: Field is required
ru_ru: Поле обязательно для заполнения
uk_ua: Поле обов'язково для заповнення

# LocGameHandleNotFound
source: Running game instances not found
ru_ru: Не найдена ни одна запущенная игра
uk_ua: Не знайдено жодної запущеної гри

# LocGameHandleSelectionHeader
source: Select game instance:
ru_ru: Выберите запущенную игру:
uk_ua: Оберіть запущену гру:

# LocCheckInAlready
source: Already claimed check-in reward
ru_ru: Награда ежедневного клика уже получена
uk_ua: Нагорода щоденної відмітки вже отримана

# LocCheckInReward
source: Reward claimed: $1 x$2
ru_ru: Награда получена: $1 $2шт.
uk_ua: Нагорода отримана: $1 $2шт.

# LocAllAccountsRefreshed
source: Accounts information refreshed
ru_ru: Информация об аккаунтах обновлена
uk_ua: Інформацію про акаунти оновлено

# LocAccountRefreshed
source: Account "$1" information refreshed
ru_ru: Обновлена информация об аккаунте "$1"
uk_ua: Оновлена інформація про акаунт "$1"

# LocAuthenticationError
source: Error authenticating account
ru_ru: Ошибка аутентификации аккаунта
uk_ua: Помилка аутентифікації акаунта

# LocAuthenticationSuccessful
source: Account succesfully authenticated!
ru_ru: Аккаунт успешно аутентифицирован!
uk_ua: Акаунт успішно аутентифіковано!

# LocWebLoginNoAuthentication
source: I don't see authentication data :(
ru_ru: Я не вижу данных аутентификации :(
uk_ua: Я не бачу даних аутентифікації :(

# LocMenuAutomation
source: Automation
ru_ru: Автоматизация
uk_ua: Автоматизація

# LocMenuAutomationDailyCheckIn
source: Daily check-in background task
ru_ru: Фоновая задача ежедневных отметок
uk_ua: Фонове завдання щоденних позначок

# LocMenuExit
source: Exit
ru_ru: Выход
uk_ua: Вихід

# LocMenuNotificationTargets
source: Notification targets
uk_ua: Повідомлення

# LocDialogAdd
source: ADD
uk_ua: ДОДАТИ

# LocAddNotificationTargetHeader
source: Add notification target
uk_ua: Додати мету повідомлення

# LocNotificationTelegramBotToken
source: Bot token
uk_ua: Токен бота

# LocNotificationTelegramChatId
source: Chat id
uk_ua: Id чату

# LocWrongIntFormat
source: Wrong number format
uk_ua: Неправильний формат числа
